In [1]:
import pandas as pd

# Series

* 데이터 구조 : index - value

# DataFrame

* 데이터 구조 : index - column - vlaue

# Series

In [3]:
s1=pd.Series([10,20,30,40])  # Series같은 경우 하나의 데이터타입만 올 수 있음
s1

0    10
1    20
2    30
3    40
dtype: int64

In [6]:
s1.sum()

100

In [7]:
s1.mean()

25.0

In [12]:
# 시리즈의 순서를 사용자가 지정가능
s2 = pd.Series(['분식','쏘니','홍길동','변사또'],
               index=['하나','둘','셋','넷'],name='출석부') #name : 시리즈의 이름 설정
s2

하나     분식
둘      쏘니
셋     홍길동
넷     변사또
Name: 출석부, dtype: object

In [16]:
# 딕셔너리 형태의 시리즈 만들기
s3=pd.Series({'name':'김분식','age':30,'gender':'male','job':'분석가'})
s3

name       김분식
age         30
gender    male
job        분석가
dtype: object

In [17]:
dic1=({'name':'김분식','age':30,'gender':'male','job':'분석가'})
pd.Series(dic1)

name       김분식
age         30
gender    male
job        분석가
dtype: object

In [18]:
# 데이터 슬라이싱 하기
s4=pd.Series(['국어','수학','사회','과학'])
s4

0    국어
1    수학
2    사회
3    과학
dtype: object

In [19]:
s4[0]

'국어'

In [20]:
s3

name       김분식
age         30
gender    male
job        분석가
dtype: object

In [21]:
s3['name']

'김분식'

In [22]:
s4[:]

0    국어
1    수학
2    사회
3    과학
dtype: object

In [23]:
s4[2:]

2    사회
3    과학
dtype: object

In [24]:
s4[:2]

0    국어
1    수학
dtype: object

In [25]:
s3

name       김분식
age         30
gender    male
job        분석가
dtype: object

In [27]:
# 데이터의 인덱스위치 찾기
s3 == '분석가'

name      False
age       False
gender    False
job        True
dtype: bool

In [29]:
s3[s3=='분석가']       # 내부에서 조건 걸기

job    분석가
dtype: object

# DataFrame

In [31]:
pd.DataFrame([10,20,30,40,50])

    0
0  10
1  20
2  30
3  40
4  50

In [33]:
pd.DataFrame([[10,20,30,40],
              ['철수','영희','분식','은희']])

    0   1   2   3
0  10  20  30  40
1  철수  영희  분식  은희

In [36]:
df1=pd.DataFrame([[1000,'과자','2019-12-31','반품'],
                 [2000,'음료','2020-03-02','정상'],
                 [3000,'아이스크림','2020-02-03','정상'],
                 [1000,'과자','2019-12-31','반품']],
                columns=['가격','종류','판매일자','반품여부'])      # columns=[]->컬럼명 설정
df1

     가격     종류        판매일자 반품여부
0  1000     과자  2019-12-31   반품
1  2000     음료  2020-03-02   정상
2  3000  아이스크림  2020-02-03   정상
3  1000     과자  2019-12-31   반품

In [37]:
df1['가격']

0    1000
1    2000
2    3000
3    1000
Name: 가격, dtype: int64

In [38]:
df1['종류']

0       과자
1       음료
2    아이스크림
3       과자
Name: 종류, dtype: object

In [39]:
# 가격 데이터 처리하기
df1['가격'].sum()

7000

In [40]:
df1['가격'].mean()

1750.0

In [41]:
df1['가격']

0    1000
1    2000
2    3000
3    1000
Name: 가격, dtype: int64

In [44]:
df1[['가격']]       # 괄호가 두개 들어가면 데이터프레임형태로 불러옴

     가격
0  1000
1  2000
2  3000
3  1000

In [46]:
# df1['가격','종류'] -> error   
# 여러개의 컬럼으로 가져올때는 데이터 프레임 형태로 가져와야함
# 시리즈는 index - value의 데이터구조이기 때문
df1[['가격','종류']]

     가격     종류
0  1000     과자
1  2000     음료
2  3000  아이스크림
3  1000     과자